{
  "terms": [
    "Economic Feasibility",
    "Logical Model",
    "Ongoing Feasibility Assessment",
    "Resource Feasibility",
    "Organizational Feasibility",
    "Operational Feasibility",
    "Technical Feasibility",
    "Project Plan",
    "Scope Statement",
    "Project Charter",
    "Cost-Benefit Analysis",
    "Integration Feasibility",
    "Net Present Value",
    "Risk Assessment",
    "Risk Management",
    "Process Diagram",
    "Usability Assessment",
    "Legal and Regulatory Feasibility",
    "Strategic Alignment",
    "Stakeholder Analysis",
    "Business Process Analysis"
  ],
  "definitions": [
    "The process of evaluating a project’s expected costs and benefits, both tangible and intangible.",
    "A diagram that depicts the logical components of a system.",
    "The ongoing process of evaluating whether a project is worth pursuing at different stages of its development.",
    "A measure of whether the organization has the resources to develop or purchase the system.",
    "The evaluation of whether the system will be accepted by the people in the organization and align with the organizational culture.",
    "The ease with which a proposed system can be implemented and used effectively.",
    "The measurement of whether the system can be developed given the available technical resources and expertise.",
    "A project proposal component that outlines the approach, timeline, and resources for development.",
    "The written description of the work that needs to be accomplished in order to deliver a product, service, or result with the specified features and functions.",
    "A document that formally authorizes a project and provides the project manager with the authority to apply organizational resources.",
    "A process used to systematically determine the benefits and costs of a proposed system.",
    "The degree to which a system can be effectively integrated into the existing infrastructure and business processes.",
    "A method for calculating the time value of money in terms of the value today of future cash flows.",
    "The process of assessing the likelihood and impact of risks in a project.",
    "The act of identifying and documenting risks and determining ways to prevent or mitigate them.",
    "A graphic representation of the major steps in a system or process.",
    "The process of determining whether the system will be usable by its intended users.",
    "The measure of how well the system complies with external laws and regulations.",
    "The measure of whether the project aligns with the organization’s strategic goals and priorities.",
    "A systematic process of identifying and analyzing stakeholders to ensure their interests are considered.",
    "The process of gaining an understanding of how an organization currently operates in order to improve future processes."
  ]
}
