{
  "terms": [
    "Relation",
    "Well-Structured Relation (or Table)",
    "Normalization",
    "Functional Dependency",
    "Second Normal Form (2NF)",
    "Third Normal Form (3NF)",
    "Foreign Key",
    "Referential Integrity",
    "Recursive Foreign Key",
    "Synonym",
    "Homonym",
    "Field",
    "Data Type",
    "Calculated Field",
    "Default Value",
    "Null Value",
    "Physical Table",
    "Denormalization",
    "File Organization",
    "Pointer",
    "Sequential File Organization",
    "Indexed File Organization",
    "Index",
    "Hashed File Organization",
    "Primary Key",
    "Relational Database Model"
  ],
  "definitions": [
    "A named, two-dimensional table of data, consisting of a set of named columns and an arbitrary number of unnamed rows.",
    "A relation that contains a minimum amount of redundancy and allows users to insert, modify, and delete the rows without errors or inconsistencies.",
    "The process of converting complex data structures into simple, stable data structures.",
    "A particular relationship between two attributes.",
    "A relation for which every nonprimary key attribute is functionally dependent on the whole primary key.",
    "A relation that is in second normal form and that has no functional (transitive) dependencies between two (or more) nonprimary key attributes.",
    "An attribute that appears as a nonprimary key attribute in one relation and as a primary key attribute (or part of a primary key) in another relation.",
    "An integrity constraint specifying that the value (or existence) of an attribute in one relation depends on the value (or existence) of the same attribute in another relation.",
    "A foreign key in a relation that references the primary key values of that same relation.",
    "Two different names that are used for the same attribute.",
    "A single attribute name that is used for two or more different attributes.",
    "The smallest unit of named application data recognized by system software.",
    "A coding scheme recognized by system software for representing organizational data.",
    "A field that can be derived from other database fields.",
    "A value a field will assume unless an explicit value is entered for that field.",
    "A special field value, distinct from a zero, blank, or any other value, that indicates that the value for the field is missing or otherwise unknown.",
    "A named set of rows and columns that specifies the fields in each row of the table.",
    "The process of splitting or combining normalized relations into physical tables based on affinity of use of rows and fields.",
    "A technique for physically arranging the records of a file.",
    "A field of data that can be used to locate a related field or row of data.",
    "A file organization technique in which the rows in the file are stored in sequence according to a primary key value.",
    "A file organization technique in which the rows are stored either sequentially or non-sequentially, and an index is created that allows software to locate individual rows.",
    "A table used to determine the location of rows in a file that satisfy some condition.",
    "A file organization technique in which the address for each row is determined using an algorithm.",
    "An attribute whose value is unique across all occurrences of a relation and is used for data retrieval as well as for defining relationships.",
    "Data represented as a set of related tables or relations."
  ]
}
