{
  "terms": [
    "Information Systems Planning",
    "Bottom-up Planning",
    "Incremental Commitment",
    "Top-down Planning",
    "Objective Statements",
    "Internet-of-Things (IoT)",
    "Competitive Strategy",
    "Affinity Clustering",
    "Internet",
    "Electronic Commerce (EC)",
    "Corporate Strategic Planning",
    "Value Chain Analysis",
    "Mission Statement"
  ],
  "definitions": [
    "An orderly means of assessing the information needs of an organization and defining the systems, databases, and technologies that will best satisfy those needs.",
    "A generic ISP methodology that identifies and defines IS development projects based upon solving operational business problems or taking advantage of some business opportunities.",
    "A strategy in systems analysis and design in which the project is reviewed after each phase and continuation of the project is re-justified.",
    "A generic ISP methodology that attempts to gain a broad understanding of the information system needs of the entire organization.",
    "A series of statements that express an organization’s qualitative and quantitative goals for reaching a desired future position.",
    "A broad class of physical objects that feature an Internet address and connectivity that communicate between these objects and other Internet-enabled devices and systems.",
    "The method by which an organization attempts to achieve its mission and objectives.",
    "The process of arranging planning matrix information so the clusters of information with a predetermined level or type of affinity are placed next to each other on a matrix report.",
    "A large, worldwide network of networks that use a common protocol to communicate with each other.",
    "Internet-based communication to support day-to-day government, business, and consumer activities.",
    "Analyzing an organization’s activities to determine where value is added to products and/or services and the costs incurred for doing so.",
    "An ongoing process that defines the mission, objectives, and strategies of an organization.",
    "A statement that makes it clear what business a company is in."
  ]
}
