{
  "terms": [
    "Conceptual Data Model",
    "Entity-Relationship Data Model (ER Model)",
    "Entity-Relationship Diagram (ER Diagram)",
    "Entity Type",
    "Entity Instance",
    "Attribute",
    "Candidate Key",
    "Identifier",
    "Multivalued Attribute",
    "Repeating Group",
    "Relationship",
    "Degree",
    "Unary Relationship",
    "Binary Relationship",
    "Ternary Relationship",
    "Cardinality",
    "Associative Entity",
    "Subtype",
    "Supertype",
    "Total Specialization Rule",
    "Partial Specialization Rule",
    "Disjoint Rule",
    "Overlap Rule",
    "Business Rules",
    "Domain",
    "Triggering Operation (Trigger)",
    "Required Attribute",
    "Optional Attribute",
    "Composite Attribute",
    "Derived Attribute"
  ],
  "definitions": [
    "A detailed model that captures the overall structure of organizational data and is independent of any database management system or other implementation considerations.",
    "A detailed, logical representation of the entities, associations, and data elements for an organization or business area.",
    "A graphical representation of an E-R model.",
    "A collection of entities that share common properties or characteristics.",
    "A single occurrence of an entity type.",
    "A named property or characteristic of an entity that is of interest to the organization.",
    "An attribute (or combination of attributes) that uniquely identifies each instance of an entity type.",
    "A candidate key that has been selected as the unique, identifying characteristic for an entity type.",
    "An attribute that may take on more than one value for each entity instance.",
    "A set of two or more multivalued attributes that are logically related.",
    "An association between the instances of one or more entity types that is of interest to the organization.",
    "The number of entity types that participate in a relationship.",
    "A relationship between the instances of one entity type.",
    "A relationship between instances of two entity types.",
    "A simultaneous relationship among instances of three entity types.",
    "The number of instances of entity B that can (or must) be associated with each instance of entity A.",
    "An entity type that associates the instances of one or more entity types and contains attributes that are peculiar to the relationship between those entity instances.",
    "A subgrouping of the entities in an entity type that is meaningful to the organization.",
    "A generic entity type that has a relationship with one or more subtypes.",
    "Specifies that each entity instance of the supertype must be a member of some subtype in the relationship.",
    "Specifies that an entity instance of the supertype does not have to belong to any subtype.",
    "Specifies that if an entity instance of the supertype is a member of one subtype, it cannot simultaneously be a member of any other subtype.",
    "Specifies that an entity instance can simultaneously be a member of two (or more) subtypes.",
    "Specifications that preserve the integrity of the logical data model.",
    "The set of all data types and values that an attribute can assume.",
    "An assertion or rule that governs the validity of data manipulation operations such as insert, update, and delete.",
    "An attribute that must have a value for every entity instance.",
    "An attribute that may not have a value for every entity instance.",
    "An attribute that has meaningful component parts.",
    "An attribute whose value can be computed from related attribute values."
  ]
}
