{
  "terms": [
    "Project Manager",
    "Project",
    "Deliverable",
    "Feasibility Study",
    "Project Management",
    "Project Initiation",
    "Project Workbook",
    "Project Planning",
    "Work Breakdown Structure (WBS)",
    "GANTT Chart",
    "Network Diagram",
    "Project Execution",
    "Project Close Down",
    "Resources",
    "Critical Path Scheduling",
    "Critical Path",
    "Slack Time",
    "PERT (Program Evaluation Review Technique)",
    "COCOMO",
    "Project Charter"
  ],
  "definitions": [
    "A systems analyst with a diverse set of skills—management, leadership, technical, conflict management, and customer relationship—who is responsible for initiating, planning, executing, and closing down a project.",
    "A planned undertaking of related activities to reach an objective that has a beginning and an end.",
    "An end product of an SDLC phase.",
    "A study that determines if the proposed information system makes sense for the organization from an economic and operational standpoint.",
    "A controlled process of initiating, planning, executing, and closing down a project.",
    "The first phase of the project management process in which activities are performed to assess the size, scope, and complexity of the project and to establish procedures to support later project activities.",
    "A repository for all project-related documents that is used for performing project audits, orienting new team members, communicating with management and customers, identifying future projects, and performing post-project reviews.",
    "The second phase of the project management process that focuses on defining clear, discrete activities and the work needed to complete each activity within a single project.",
    "The process of dividing the project into manageable tasks and logically ordering them to ensure a smooth evolution between tasks.",
    "A graphical representation of a project that shows each task as a horizontal bar whose length is proportional to its time for completion.",
    "A diagram that depicts project tasks and their interrelationships.",
    "The third phase of the project management process in which the plans created in the prior phases are put into action.",
    "The final phase of the project management process that focuses on bringing a project to an end.",
    "Any person, group of people, piece of equipment, or material used in accomplishing an activity.",
    "A scheduling technique whose order and duration of a sequence of task activities directly affect the completion date of a project.",
    "The shortest time in which a project can be completed.",
    "The amount of time that an activity can be delayed without delaying the entire project.",
    "A technique that uses optimistic, pessimistic, and realistic time estimates to calculate the expected completion for a particular task.",
    "An automated software estimation model that uses historical project data and current as well as future project characteristics to estimate project costs.",
    "A short document prepared for the customer during project initiation that describes what the project will deliver and outlines, generally at a high level, all work required to complete the project."
  ]
}
